content/projects.md
+++
title = "Projects"
draft = false
[menu]
  [menu.main]
    weight = 1004
    identifier = "projects"
+++

## Assessments App [2021-now] {#assessments-app-2021-now}

I am currently working on a research project by ERASMUS+, trying to
understand how can technology affect the life of both students,
parents and teacher in the classroom context. Furthermore, I am
developing an application, the main features alongside the 3 different
interfaces (Student, Parent and Teacher) are:

-   Create multiple classes (as a Teacher);
-   Student/Parent integration with a Teacher, within a specific class;
-   Generate Formative and Summative assessments, both for the class or for each student individually;
-   Assess students (as a Teacher);
-   A list of default competences;
-   Create new competences (as a Teacher);
-   View the progress of each student _per_ competence and _per_
    indicator, as a Teacher and as a Parent.
-   View the overall progression of the class.

The source code is available [here](https://github.com/n1ghtbyte/Assessments-App), to install the app on an Android device, download the [release for android](https://github.com/n1ghtbyte/Assessments-App/releases).


## AstroPi <code>[2018/2019]</code> {#astropi}

The European Astro Pi Challenge is an ESA Education project run in
collaboration with the Raspberry Pi Foundation, it consists in
conducting a scientific experiment in space. Me and my friends
participated in the _Mission Space Lab_ category, we intended to
demonstrate the validity of _Galileo's Theory of Relativity_, from an
experimental point of view, using the RaspberryPi. Using a mathematical model deducted, we used the photographs of
the Earth among with their coordinates to calculate the relative velocity
and prove the importance of the Galileo's Theory of Relativity in
experiments with this type of systems. As a secondary mission, we used
the Humidity, Pressure and Temperature sensors to turn the RaspberryPi
into a Human-Presence detector.

All the code, images and final report can be found [here](https://github.com/n1ghtbyte/Astro-Pi).
